tutorials/cfdemSolverRhoPimpleChem/MultiParticle_Hematite_dp1e6/CFD/constant/foam.inp
species
(
        CO
        CO2
	N2
);

reactions
{
}


