tutorials/cfdemSolverRhoPimpleChem/MultiParticle_Hematite_dp1e6/CFD/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         reactingMixture;    //species and reactions are listed in chemistry file
    transport       sutherland;         //calcualtes viscosity as a function of temperature from Stuherland coefficient As and Ts
    thermo          janaf;
    energy          sensibleEnthalpy;   //uses enthaly in the solution
    equationOfState perfectGas;         
    specie          specie;
}

chemistryReader foamChemistryReader;

foamChemistryThermoFile     "$casePath/CFD/constant/foam.dat";

foamChemistryFile           "$casePath/CFD/constant/foam.inp";

inertSpecie     N2;        
/*liquids
{
    H2O
    {
        defaultCoeffs   yes;
    }
}

solids
{
    C
    {
        defaultCoeffs   no;
        // if  defaultCoeffs no properties should be :
        CCoeffs
        {
            rho             2010;
            Cp              710;
            K               0.04;
            Hf              0;
            emissivity      1.0;
        }
    }
    ash
    {
        defaultCoeffs   yes;
    }
}


// ************************************************************************* //
